"""Фундаментальные концепции программирования — математические операции."""

n1 = 8
n2 = 4

print("Сумма:", n1 + n2)  # n1 + n2

print("Разность:", n1 - n2)  # n1 - n2

print("Произведение:", n1 * n2)  # n1 × n2

print("Частное:", n1 / n2)  # n1 ÷ n2

n1 = 5
n2 = 2

print("Степень:", n1**n2)  # Возведение n1 в степень n2

print(
    "Целочисленное деление:", n1 // n2
)  # (//) целочисленное деление возвращает целое число при делении n1 на n2

print(
    "Остаток от деления:", n1 % n2
)  # (%) возвращает остаток от деления n1 на n2
